# 데이터 불러오기

In [73]:
import pandas as pd

In [74]:
master_df = pd.read_csv('./result/wholesale_2022-06-23_preprocessed.csv')

In [75]:
master_df

,category_code,p_code,p_group,kind_name_new,rank,unit,price,date
0,AW_A00115,AW_A00115,쌀,쌀(일반계)(20kg),상품,20kg,"44,500",2022-06-23
1,AW_A00116,AW_A00116,쌀,쌀(일반계)(20kg),중품,20kg,"41,000",2022-06-23
2,AW_A00153,AW_A00153,찹쌀,찹쌀(일반계)(40kg),중품,40kg,"97,800",2022-06-23
3,AW_A00198,AW_A00198,콩,흰 콩(국산)(40kg),상품,40kg,"240,000",2022-06-23
4,AW_A00200,AW_A00200,콩,흰 콩(수입)(35kg),중품,35kg,"122,000",2022-06-23
...,...,...,...,...,...,...,...,...
44564,SW_A00020,SW_A00020,건오징어,건오징어(20마리),중품,20마리,"77,000",2021-06-24
44565,SW_A00053,SW_A00053,김,마른김(1속),중품,1속,"6,000",2021-06-24
44566,SW_A00019,SW_A00019,건미역,건미역(1kg),상품,1kg,"10,000",2021-06-24
44567,SW_A00140,SW_A00140,전복,전복(1kg),중품,1kg,"33,000",2021-06-24
44568,SW_A00107,SW_A00107,새우,새우(흰다리)(수입),중품,2kg,"20,000",2021-06-24

In [76]:
def remove_comma(price):
    """price 사이의 구두점 제거"""
    if type(price) == str:
        return "".join(price.split(","))
    else:
        return None

In [77]:
price_df = pd.DataFrame()
price_df['date'] = master_df['date']
price_df['price'] = master_df['price'].apply(remove_comma)
price_df['p_code'] = master_df['p_code']

In [78]:
price_df

             date   price     p_code
0      2022-06-23   44500  AW_A00115
1      2022-06-23   41000  AW_A00116
2      2022-06-23   97800  AW_A00153
3      2022-06-23  240000  AW_A00198
4      2022-06-23  122000  AW_A00200
...           ...     ...        ...
44564  2021-06-24   77000  SW_A00020
44565  2021-06-24    6000  SW_A00053
44566  2021-06-24   10000  SW_A00019
44567  2021-06-24   33000  SW_A00140
44568  2021-06-24   20000  SW_A00107

[44569 rows x 3 columns]

# 일단 가격이 0인 데이터는 제거
    
    - 필요시 나중에 재검토 예정

In [79]:
wholesale_price_null_df = price_df[price_df['price'].isnull()]

In [80]:
wholesale_price_null_df

             date price     p_code
56     2022-06-18  None  AW_A00115
57     2022-06-18  None  AW_A00116
58     2022-06-18  None  AW_A00153
59     2022-06-18  None  AW_A00198
60     2022-06-18  None  AW_A00200
...           ...   ...        ...
44534  2021-06-26  None  SW_A00020
44535  2021-06-26  None  SW_A00053
44536  2021-06-26  None  SW_A00019
44537  2021-06-26  None  SW_A00140
44538  2021-06-26  None  SW_A00107

[10081 rows x 3 columns]

In [81]:
wholesale_price_null_df.to_csv('./result/price_zero.csv', index=False)

In [82]:
# price_df 에서 price가 None인 index 제거
price_df.dropna(inplace=True)

In [83]:
price_df = price_df.reset_index(drop=True)

In [84]:
price_df

             date   price     p_code
0      2022-06-23   44500  AW_A00115
1      2022-06-23   41000  AW_A00116
2      2022-06-23   97800  AW_A00153
3      2022-06-23  240000  AW_A00198
4      2022-06-23  122000  AW_A00200
...           ...     ...        ...
34483  2021-06-24   77000  SW_A00020
34484  2021-06-24    6000  SW_A00053
34485  2021-06-24   10000  SW_A00019
34486  2021-06-24   33000  SW_A00140
34487  2021-06-24   20000  SW_A00107

[34488 rows x 3 columns]

In [85]:
# 소매 물가 데이터 마지막 id = 146054 (2022-06-28 시점)
price_df['id'] = [ i + 146055 for i in range(len(price_df))]

In [86]:
price_df

             date   price     p_code      id
0      2022-06-23   44500  AW_A00115  146055
1      2022-06-23   41000  AW_A00116  146056
2      2022-06-23   97800  AW_A00153  146057
3      2022-06-23  240000  AW_A00198  146058
4      2022-06-23  122000  AW_A00200  146059
...           ...     ...        ...     ...
34483  2021-06-24   77000  SW_A00020  180538
34484  2021-06-24    6000  SW_A00053  180539
34485  2021-06-24   10000  SW_A00019  180540
34486  2021-06-24   33000  SW_A00140  180541
34487  2021-06-24   20000  SW_A00107  180542

[34488 rows x 4 columns]

In [87]:
price_df.to_csv('./result/price_wholesale.csv', index=False)

# DB에 데이터 삽입하기

In [92]:
import pymysql

db = pymysql.connect(host="db-1.cnt4cbkbsgdt.us-east-1.rds.amazonaws.com",
                     port=3306,
                     user='admin',
                     passwd='12345678',
                     db='public_api',
                     charset='utf8')

cursor = db.cursor()

# 상품 데이터 삽입
for idx, row in price_df.iterrows():

    sql = f"INSERT INTO price VALUES({row['id']},'{row['date']}',{row['price']},'{row['p_code']}')"
    cursor.execute(sql)
    db.commit()

    if idx % 100 == 0:
        print(f"{idx} 번째 row insert 완료")

0 번째 row insert 완료
100 번째 row insert 완료
200 번째 row insert 완료
300 번째 row insert 완료
400 번째 row insert 완료
500 번째 row insert 완료
600 번째 row insert 완료
700 번째 row insert 완료
800 번째 row insert 완료
900 번째 row insert 완료
1000 번째 row insert 완료
1100 번째 row insert 완료
1200 번째 row insert 완료
1300 번째 row insert 완료
1400 번째 row insert 완료
1500 번째 row insert 완료
1600 번째 row insert 완료
1700 번째 row insert 완료
1800 번째 row insert 완료
1900 번째 row insert 완료
2000 번째 row insert 완료
2100 번째 row insert 완료
2200 번째 row insert 완료
2300 번째 row insert 완료
2400 번째 row insert 완료
2500 번째 row insert 완료
2600 번째 row insert 완료
2700 번째 row insert 완료
2800 번째 row insert 완료
2900 번째 row insert 완료
3000 번째 row insert 완료
3100 번째 row insert 완료
3200 번째 row insert 완료
3300 번째 row insert 완료
3400 번째 row insert 완료
3500 번째 row insert 완료
3600 번째 row insert 완료
3700 번째 row insert 완료
3800 번째 row insert 완료
3900 번째 row insert 완료
4000 번째 row insert 완료
4100 번째 row insert 완료
4200 번째 row insert 완료
4300 번째 row insert 완료
4400 번째 row insert 완료
4500 번째 row insert 완료
4600 번째 row insert 완료
4700 번째 row insert 완료
4800 번째 row insert 완료
4900 번째 row insert 완료
5000 번째 row insert 완료
5100 번째 row insert 완료
5200 번째 row insert 완료
5300 번째 row insert 완료
5400 번째 row insert 완료
5500 번째 row insert 완료
5600 번째 row insert 완료
5700 번째 row insert 완료
5800 번째 row insert 완료
5900 번째 row insert 완료
6000 번째 row insert 완료
6100 번째 row insert 완료
6200 번째 row insert 완료
6300 번째 row insert 완료
6400 번째 row insert 완료
6500 번째 row insert 완료
6600 번째 row insert 완료
6700 번째 row insert 완료
6800 번째 row insert 완료
6900 번째 row insert 완료
7000 번째 row insert 완료
7100 번째 row insert 완료
7200 번째 row insert 완료
7300 번째 row insert 완료
7400 번째 row insert 완료
7500 번째 row insert 완료
7600 번째 row insert 완료
7700 번째 row insert 완료
7800 번째 row insert 완료
7900 번째 row insert 완료
8000 번째 row insert 완료
8100 번째 row insert 완료
8200 번째 row insert 완료
8300 번째 row insert 완료
8400 번째 row insert 완료
8500 번째 row insert 완료
8600 번째 row insert 완료
8700 번째 row insert 완료
8800 번째 row insert 완료
8900 번째 row insert 완료
9000 번째 row insert 완료
9100 번째 row insert 완료
9200 번째 row insert 완료
9300 번째 row insert 완료
9400 번째 row insert 완료
9500 번째 row insert 완료
9600 번째 row insert 완료
9700 번째 row insert 완료
9800 번째 row insert 완료
9900 번째 row insert 완료
10000 번째 row insert 완료
10100 번째 row insert 완료
10200 번째 row insert 완료
10300 번째 row insert 완료
10400 번째 row insert 완료
10500 번째 row insert 완료
10600 번째 row insert 완료
10700 번째 row insert 완료
10800 번째 row insert 완료
10900 번째 row insert 완료
11000 번째 row insert 완료
11100 번째 row insert 완료
11200 번째 row insert 완료
11300 번째 row insert 완료
11400 번째 row insert 완료
11500 번째 row insert 완료
11600 번째 row insert 완료
11700 번째 row insert 완료
11800 번째 row insert 완료
11900 번째 row insert 완료
12000 번째 row insert 완료
12100 번째 row insert 완료
12200 번째 row insert 완료
12300 번째 row insert 완료
12400 번째 row insert 완료
12500 번째 row insert 완료
12600 번째 row insert 완료
12700 번째 row insert 완료
12800 번째 row insert 완료
12900 번째 row insert 완료
13000 번째 row insert 완료
13100 번째 row insert 완료
13200 번째 row insert 완료
13300 번째 row insert 완료
13400 번째 row insert 완료
13500 번째 row insert 완료
13600 번째 row insert 완료
13700 번째 row insert 완료
13800 번째 row insert 완료
13900 번째 row insert 완료
14000 번째 row insert 완료
14100 번째 row insert 완료
14200 번째 row insert 완료
14300 번째 row insert 완료
14400 번째 row insert 완료
14500 번째 row insert 완료
14600 번째 row insert 완료
14700 번째 row insert 완료
14800 번째 row insert 완료
14900 번째 row insert 완료
15000 번째 row insert 완료
15100 번째 row insert 완료
15200 번째 row insert 완료
15300 번째 row insert 완료
15400 번째 row insert 완료
15500 번째 row insert 완료
15600 번째 row insert 완료
15700 번째 row insert 완료
15800 번째 row insert 완료
15900 번째 row insert 완료
16000 번째 row insert 완료
16100 번째 row insert 완료
16200 번째 row insert 완료
16300 번째 row insert 완료
16400 번째 row insert 완료
16500 번째 row insert 완료
16600 번째 row insert 완료
16700 번째 row insert 완료
16800 번째 row insert 완료
16900 번째 row insert 완료
17000 번째 row insert 완료
17100 번째 row insert 완료
17200 번째 row insert 완료
17300 번째 row insert 완료
17400 번째 row insert 완료
17500 번째 row insert 완료
17600 번째 row insert 완료
17700 번째 row insert 완료
17800 번째 row insert 완료
17900 번째 row insert 완료
18000 번째 row insert 완료
18100 번째 row insert 완료
18200 번째 row insert 완료
18300 번째 row insert 완료
18400 번째 row insert 완료
18500 번째 row insert 완료
18600 번째 row insert 완료
18700 번째 row insert 완료
18800 번째 row insert 완료
18900 번째 row insert 완료
19000 번째 row insert 완료
19100 번째 row insert 완료
19200 번째 row insert 완료
19300 번째 row insert 완료
19400 번째 row insert 완료
19500 번째 row insert 완료
19600 번째 row insert 완료
19700 번째 row insert 완료
19800 번째 row insert 완료
19900 번째 row insert 완료
20000 번째 row insert 완료
20100 번째 row insert 완료
20200 번째 row insert 완료
20300 번째 row insert 완료
20400 번째 row insert 완료
20500 번째 row insert 완료
20600 번째 row insert 완료
20700 번째 row insert 완료
20800 번째 row insert 완료
20900 번째 row insert 완료
21000 번째 row insert 완료
21100 번째 row insert 완료
21200 번째 row insert 완료
21300 번째 row insert 완료
21400 번째 row insert 완료
21500 번째 row insert 완료
21600 번째 row insert 완료
21700 번째 row insert 완료
21800 번째 row insert 완료
21900 번째 row insert 완료
22000 번째 row insert 완료
22100 번째 row insert 완료
22200 번째 row insert 완료
22300 번째 row insert 완료
22400 번째 row insert 완료
22500 번째 row insert 완료
22600 번째 row insert 완료
22700 번째 row insert 완료
22800 번째 row insert 완료
22900 번째 row insert 완료
23000 번째 row insert 완료
23100 번째 row insert 완료
23200 번째 row insert 완료
23300 번째 row insert 완료
23400 번째 row insert 완료
23500 번째 row insert 완료
23600 번째 row insert 완료
23700 번째 row insert 완료
23800 번째 row insert 완료
23900 번째 row insert 완료
24000 번째 row insert 완료
24100 번째 row insert 완료
24200 번째 row insert 완료
24300 번째 row insert 완료
24400 번째 row insert 완료
24500 번째 row insert 완료
24600 번째 row insert 완료
24700 번째 row insert 완료
24800 번째 row insert 완료
24900 번째 row insert 완료
25000 번째 row insert 완료
25100 번째 row insert 완료
25200 번째 row insert 완료
25300 번째 row insert 완료
25400 번째 row insert 완료
25500 번째 row insert 완료
25600 번째 row insert 완료
25700 번째 row insert 완료
25800 번째 row insert 완료
25900 번째 row insert 완료
26000 번째 row insert 완료
26100 번째 row insert 완료
26200 번째 row insert 완료
26300 번째 row insert 완료
26400 번째 row insert 완료
26500 번째 row insert 완료
26600 번째 row insert 완료
26700 번째 row insert 완료
26800 번째 row insert 완료
26900 번째 row insert 완료
27000 번째 row insert 완료
27100 번째 row insert 완료
27200 번째 row insert 완료
27300 번째 row insert 완료
27400 번째 row insert 완료
27500 번째 row insert 완료
27600 번째 row insert 완료
27700 번째 row insert 완료
27800 번째 row insert 완료
27900 번째 row insert 완료
28000 번째 row insert 완료
28100 번째 row insert 완료
28200 번째 row insert 완료
28300 번째 row insert 완료
28400 번째 row insert 완료
28500 번째 row insert 완료
28600 번째 row insert 완료
28700 번째 row insert 완료
28800 번째 row insert 완료
28900 번째 row insert 완료
29000 번째 row insert 완료
29100 번째 row insert 완료
29200 번째 row insert 완료
29300 번째 row insert 완료
29400 번째 row insert 완료
29500 번째 row insert 완료
29600 번째 row insert 완료
29700 번째 row insert 완료
29800 번째 row insert 완료
29900 번째 row insert 완료
30000 번째 row insert 완료
30100 번째 row insert 완료
30200 번째 row insert 완료
30300 번째 row insert 완료
30400 번째 row insert 완료
30500 번째 row insert 완료
30600 번째 row insert 완료
30700 번째 row insert 완료
30800 번째 row insert 완료
30900 번째 row insert 완료
31000 번째 row insert 완료
31100 번째 row insert 완료
31200 번째 row insert 완료
31300 번째 row insert 완료
31400 번째 row insert 완료
31500 번째 row insert 완료
31600 번째 row insert 완료
31700 번째 row insert 완료
31800 번째 row insert 완료
31900 번째 row insert 완료
32000 번째 row insert 완료
32100 번째 row insert 완료
32200 번째 row insert 완료
32300 번째 row insert 완료
32400 번째 row insert 완료
32500 번째 row insert 완료
32600 번째 row insert 완료
32700 번째 row insert 완료
32800 번째 row insert 완료
32900 번째 row insert 완료
33000 번째 row insert 완료
33100 번째 row insert 완료
33200 번째 row insert 완료
33300 번째 row insert 완료
33400 번째 row insert 완료
33500 번째 row insert 완료
33600 번째 row insert 완료
33700 번째 row insert 완료
33800 번째 row insert 완료
33900 번째 row insert 완료
34000 번째 row insert 완료
34100 번째 row insert 완료
34200 번째 row insert 완료
34300 번째 row insert 완료
34400 번째 row insert 완료